Моя_подготовка_БУДЗ3/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Моя_подготовка_БУДЗ3/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

Моя_подготовка_БУДЗ3/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.01</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.02</code>
      </childItems>
      <childItems>
        <name>ТоварыВПути</name>
        <description>Товары в пути</description>
        <code>01.03</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>01.04</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ОсновноеПроизводство</name>
        <description>Основное производство</description>
        <code>01.05</code>
      </childItems>
      <childItems>
        <name>ОбщехозяйственныеЗатраты</name>
        <description>Общехозяйственные затраты</description>
        <code>01.06</code>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыВыданные</name>
        <description>Кредиты и займы выданные</description>
        <code>01.07</code>
      </childItems>
      <childItems>
        <name>Материалы</name>
        <description>Материалы</description>
        <code>01.08</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>02.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыПолученные</name>
        <description>Кредиты и займы полученные</description>
        <code>02.03</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Налоги</name>
        <description>Налоги</description>
        <code>02.04</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ПрибылиУбытки</name>
      <description>Прибыли убытки</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Моя_подготовка_БУДЗ3/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.СвойстваНоменклатуры</types>
  </type>
  <predefined>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Свойство</name>
      <description>Свойство</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>Склад</name>
      <description>Склад</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Моя_подготовка_БУДЗ3/src/Documents/ПриходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Управленческий.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура.Деталь КАК ЭтоДеталь,
		|	ПриходнаяНакладнаяСписокНоменклатуры.Свойство КАК Свойство,
		|	СУММА(ПриходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
		|	СУММА(ПриходнаяНакладнаяСписокНоменклатуры.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ПриходнаяНакладная.СписокНоменклатуры КАК ПриходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	ПриходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура,
		|	ПриходнаяНакладнаяСписокНоменклатуры.Свойство";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// регистр Управленческий 
		Движение = Движения.Управленческий.Добавить();
		
		Движение.СчетКт = ПланыСчетов.Управленческий.Поставщики;
		Движение.Период = Дата;
		Движение.КоличествоДт = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = Склад;
		
		Если ВыборкаДетальныеЗаписи.ЭтоДеталь Тогда
			Движение.СчетДт = ПланыСчетов.Управленческий.Материалы;
		Иначе
			Движение.СчетДт = ПланыСчетов.Управленческий.Товары;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Свойство] = ВыборкаДетальныеЗаписи.Свойство;
		КонецЕсли;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
